[
  {
    "ID": "TOM-BB",
    "BRAND": "Baker Creek",
    "PRODUCTNAME": "Black Beauty Tomato (Approx. 25 seeds)",
    "GRAPHICNAME": "Black_Beauty_Tomato.png",
    "COST": "1.20",
    "MSRP": "5.00",
    "QTYONHAND": "500",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "80 days. The darkest tomato we know! A dark, meaty, very rich-fleshed tomato with extreme anthocyanin expression (same antioxidant in blueberries and blackberries). So dark that some tomatoes turn solid blue-black on the skin. Deep red flesh is among the best tasting of all tomatoes. Rich, smooth and savory with earthy tones. Hangs well on the vine and stores very well, and the flavor improves with room-temperature storage. Our own Dave Kaiser tasted it at the 2015 National Heirloom Exposition and proclaimed it as the BEST tomato he had ever eaten!Full Sun Sprouts in 7-14 Days, Ideal Temperature: 75-95 Degrees F,Seed Depth: 1/8 inch, Plant Spacing: 24\", Frost Hardy: No, Solanum lycopersicum,Growing Tips: Start indoors 6-10 weeks before last frost. Heat mat helps to warm soil and speed germination."



  },
  {
    "ID": "PEA-BB",
    "BRAND": "Baker Creek",
    "PRODUCTNAME": "Blue Buterfly Pea (Approx. 20 seeds)",
    "GRAPHICNAME": "Blue_Butterfly_Pea.png",
    "COST": "1.10",
    "MSRP": "4.00",
    "QTYONHAND": "0",
    "QTYONBACKORDER": "50",
    "DESCRIPTION": "This is a single flower butterfly pea; beautiful, simplistic blue flowers are used in herbal medicine and Asian cuisine. The vines climb a trellis or arbor beautifully, and they produce tons of little flowers throughout the summer. It is very easy to harvest the flowers and dry to make an amazing deep blue tea that is said to be effective in calming the mind.6-12 hours of Sun, Sprouts in 14-21 Days, Ideal Temperature: 78-100 F, Seed Depth: 1/2\", Plant Spacing: 3-6\", Frost Hardy: No, Clitoria ternatea, Growing Tips: Scarify and soak seed overnight before sowing. Start indoors 6-8 weeks before last frost or sow outdoors after danger of frost. Perennial in zones 10-11 or as annual in cooler climates. Climbing vine needs support."

  },
  {
    "ID": "POPPY-HENC",
    "BRAND": "Baker Creek",
    "PRODUCTNAME": "Hens and Chickens Poppy (Approx. 200 seeds)",
    "GRAPHICNAME": "Hens_And_Chickens_Poppy.png",
    "COST": "0.60",
    "MSRP": "3.50",
    "QTYONHAND": "150",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "Annual. Extraterrestrial and out of this world! The Hen and Chicks poppy is highly coveted by fine florists who use the unusual seed heads in arrangements. Named for its unusual habit of forming small clusters of smaller seed pods in a halo shape around the main seed pod, like a momma hen and her chicks. The fresh flowers are gorgeous in their own right, with silky pink petals splashed with purple. As the petals fall, the strikingly unusual form of the seed pods is fully revealed! Plants stand 2.5-3' tall on long slender stems that make them excellent for cutting and drying. Easily self sows! Annual, Full Sun, Sprouts in 14-21 Days, Seed Depth: Surface Sow, Ideal Temperature: 60-65 F, Plant Spacing: 8-10\", Frost Hardy: Yes, Papaver somniferum, Growing Tips: Direct sow in late fall, or in spring as soon as soil can be worked. Surface sow, just barely covering. Grows best in cool, early spring conditions in rich soil, with moderate moisture."


  },
  {
    "ID": "DAHLIA-MSM",
    "BRAND": "Baker Creek",
    "PRODUCTNAME": "Mignon Single Mix Dahlia (Approx. 30 seeds)",
    "GRAPHICNAME": "Mignon_Single_Mix_Dahlia.png",
    "COST": "0.52",
    "MSRP": "3.00",
    "QTYONHAND": "500",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "Tender Perennial. Compact, rounded plants are a useful size, reaching about 20 inches—perfect for bedding, large enough to make a real showing in containers or window boxes. Flowers are single, large at 3-4 inches, with petals of unusually heavy substance. Colors are perky dahlia tones of white, pinks, soft yellows, and reds. Tender Perennial, Full Sun, Sprouts in 7-14 Days, Seed Depth: 1/8\", Ideal Temperature: 70-75 F, Plant Spacing: 18-24\", Frost Hardy: No, Dahlia variabilis, Growing Tips: Start indoors 4-6 weeks before last frost, or direct sow after spring frosts have passed. Require full sun, rich soil, warm temps and moderate moisture. Tubers may be overwintered in frost-free conditions and replanted following year."


  },
  {
    "ID": "BUCKWHT-TR",
    "BRAND": "Baker Creek",
    "PRODUCTNAME": "Takane Ruby Buckwheat (Approx. 75 seeds)",
    "GRAPHICNAME": "Takane_Ruby_Buckwheat.png",
    "COST": "0.95",
    "MSRP": "4.00",
    "QTYONHAND": "0",
    "QTYONBACKORDER": "75",
    "DESCRIPTION": "A brilliant, ruby-red flowering superfood from Japan. Pink and red flowering buckwheat is a rare and wondrous pseudo-grain; blankets of pink can be seen blooming high in the Himalayas. In the late 1980s, Akio Ujihara, a professor emeritus from Shinshu University in Japan, collected seeds for a unique flowering buckwheat from Yunnan, China, at about 12,000 feet elevation. The professor selected and perfected this variety, and the signature red blanketed fields can now be found in Nara Prefecture, Japan. Japanese farmers quickly embraced this as a stunning cover crop, much more beautiful than white buckwheat. Tourism in the area to see the pink and red buckwheat fields has skyrocketed. The seeds are ground into a flour for soba noodles and can also be sprouted for a highly nutritious microgreen. In Japan, buckwheat is also brewed into tea and made into cookies. Honey from bees who fed on ruby buckwheat was analyzed by Shinshu University and shown to contain 100 times the antioxidant effect of regular honey.6-12 hours of Sun, Sprouts in 7-12 Days, Ideal Temperature: min 41 F, Seed Depth: 1/4\", Plant Spacing: 6\", Frost Hardy: No, Fagopyrum esculentum, Growing Tips: Buckwheat blooms very quickly, often 6-8 weeks after sowing. For soil improvement, plants should be mowed as soon as blooms appear. For grain, wait for full maturity."

  },
  {
    "ID": "ALYSSUM-TW",
    "BRAND": "Baker Creek",
    "PRODUCTNAME": "Tall White Sweet Alyssum (Approx. 400 seeds)",
    "GRAPHICNAME": "Tall_White_Sweet_Alyssum.png",
    "COST": "0.30",
    "MSRP": "2.75",
    "QTYONHAND": "500",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "This cheery white staple of cottage gardens since who-knows-when hardly needs an introduction! Tiny, snow-white flowers are produced by the hundreds on spikes reaching just 1' in height. The fragrance is just like honey! Tuck them at the edge of borders or along walks. The small plants are also great in window boxes, pots, or anywhere their sweet scent may be savored! Annual, Full Sun, Sprouts in 8-10 days, Seed Depth: Surface Sow, Ideal Temperature: 65-70 F, Plant Spacing: 2-4\" , Frost Hardy: No, Lobularia maritima, Growing Tips: Sow indoors 4-5 weeks before last frost. Requires light and moisture for germination. Directly sow as soon as the soil can be worked. Prefers loamy soil, but is tolerant of most soil types."

  },
  {
    "ID": "BEET-CRIMG",
    "BRAND": "Mr. Fothergills",
    "PRODUCTNAME": "Beetroot Crimson Globe",
    "GRAPHICNAME": "Beetroot_Crimson_Globe.png",
    "COST": "1.80",
    "MSRP": "3.75",
    "QTYONHAND": "1000",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "Botanical Name: Beta vulgaris. A very easily grown vegetable, and extremely versatile. Eat it fresh or pickled in salads, or use hot served with a white sauce. This deep crimson variety is extremely popular for its fine flavour. Beetroot grows well on most well-cultivated soils. Ideal for deep freezing. How To Grow: Sow 1in (2.5cm) deep in rows 1ft (30cm) apart. Keep soil moist. Sow thinly and repeat at intervals for succession. Thin out to 4in (10cm) when large enough to handle. Don't cut leaves but twist them off as this will prevent bleeding. When To Plant: Throughout the year as required. Harvest: Throughout the year as required. Sow: Spring, Summer, Autumn, Winter"

  },
  {
    "ID": "CUCUM-CRYA",
    "BRAND": "Mr. Fothergills",
    "PRODUCTNAME": "Cucumber Crystal Apple (Approx. 75 seeds)",
    "GRAPHICNAME": "Cucumber_Crystal_Apple.png",
    "COST": "1.12",
    "MSRP": "4.90",
    "QTYONHAND": "400",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "Easy to grow, producing prolific crops of small fairly round cues which become deeper yellow as they mature.How To Grow: Sow 12mm deep, direct in final position. Sow 4 or 5 seeds in clumps, later thinning to the two strongest seedlings. Allow 40-50cm between clumps. When the young plants have 5 or 6 leaves, pinch out growing tips to encourage growth of side shoots. Grow alongside a trellis or fence if space is limited. Keep plants well watered, and prepare the soil well by adding organic material and a complete fertiliser.When To Plant: Spring to mid Summer. Harvest: Summer and Autumn. Sow: Spring, Summer"
  },
  {
    "ID": "PUMP-J",
    "BRAND": "Mr. Fothergills",
    "PRODUCTNAME": "Pumpkin Jarrahdale (Approx. 25 seeds)",
    "GRAPHICNAME": "Pumpkin_Jarrahdale.png",
    "COST": "2.40",
    "MSRP": "5.20",
    "QTYONHAND": "90",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "Jarrahdale is of excellent quality with a sweet flavour. Cuts well. Best results are obtained in full sun on rich, well drained soil.How To Grow:  Drop seeds 10cm (half inch) deep direct in final position. Sow 4 or 5 seeds in clumps, later thinning to the two strongest seedlings. Allow 100cm (3ft) between rows and 40-50cm between clumps. When the young plants have 5 or 6 leaves pinch out the growing tips to encourage growth of side shoots. Grow alongside a fence if space is limited. Keep plants well watered and prepare the soil well by adding organic material and/or complete fertiliser. When To Plant: Spring and Summer. Harvest: When the vine dies and fruit stalks are dry. Sow: Spring, Summer"

  },
  {
    "ID": "TOM-PA",
    "BRAND": "Mr. Fothergills",
    "PRODUCTNAME": "Tomato Pineapple (Approx. 75 seeds)",
    "GRAPHICNAME": "Tomato_Pineapple.png",
    "COST": "0.93",
    "MSRP": "4.10",
    "QTYONHAND": "200",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "These attractive heirloom tomatoes produce large unique bicoloured fruits of yellow and orange. These sweet fruits grow up to 500g, are rich in flavour and have an exceptional texture. They look exquisite when presented in salads. How To Grow: Sow 5mm deep in pots or trays of seed raising mix. Transplant to 10-15cm pots in a warm, sunny spot after first true leaves have formed, and then to final fruiting position when sturdy enough. Space plants 75cm apart each way, and support with a stake or frame. Water daily, and when the first truss has set, feed regularly. Pinch out the side shoots as they appear. This variety can also be sown direct into the final growing position from mid Spring. Seedlings emerge 7-14 days.Harvest: 12-14 weeks, Sow: Spring, Summer"

  },
  {
    "ID": "ASTER-CG",
    "BRAND": "Mr. Fothergills",
    "PRODUCTNAME": "Aster Californian Giant (Approx. 250 seeds)",
    "GRAPHICNAME": "Aster_Californian_Giant.png",
    "COST": "0.60",
    "MSRP": "4.90",
    "QTYONHAND": "800",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "This 'old favourite' produces brilliantly coloured displays during Summer. The large ruffled Aster blooms keep well as cut flowers. An annual, flowers the same year in sun or partial shade. Plant Height: 60cm How To Grow: Sow in seed boxes or punnets, 6mm (quarter-inch) deep, or direct in flowering position. Plant 45cm (18in) apart, waiting until frosts are over. In hot weather, spread a mulch of lawn clippings or compost over the soil surface to conserve moisture and keep roots cool. Asters require plenty of water during their growing and flowering season. When To Plant: Spring through Autumn. Flowering: 16 weeks - Flowers for months on end. Sow: Spring, Summer, Autumn."

  },
  {
    "ID": "MARIG-CAR",
    "BRAND": "Mr. Fothergills",
    "PRODUCTNAME": "Marigold Carmen (Approx. 100 seeds)",
    "GRAPHICNAME": "Marigold_Carmen.png",
    "COST": "1.14",
    "MSRP": "4.10",
    "QTYONHAND": "600",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "Masses of rusty red flowers with bright yellow centres Compact, uniform plants for beds or containers. Flowers over a long period. Great companion plant and a pest deterrent. How To Grow: Sow 5mm deep direct where they are to grow, or in seed trays, transplanting when about 5cm (2-3”) high. Thin to 15-20cm (6-8”) apart and keep moist. Water regularly at base of plants. Feed with liquid fertiliser when buds appear. Seedlings emerge 10-14 days. When To Plant: Spring to early Summer. Flowering: 12 weeks, Sow: Spring, Summer, Soil Type: well drained."

  },
  {
    "ID": "DILL-DUK",
    "BRAND": "West Coast Seeds",
    "PRODUCTNAME": "Dukat Dill (5g)",
    "GRAPHICNAME": "Dukat_Dill.png",
    "COST": "0.96",
    "MSRP": "4.99",
    "QTYONHAND": "0",
    "QTYONBACKORDER": "150",
    "DESCRIPTION": "Dukat dill seeds produce dill with a particularly fine bouquet and flavour. The darker-than-usual leaves are excellent fresh or dried. Dukat has exceptionally large seed heads. Dukat is the variety to grow for homemade dill pickles, and can be grown in a large container in full sun. This dill stays relatively short at 45-60cm. The structure of dill's flowers is known as an umbel. Thus dill is considered an umbelliferous plant. Other umbellifers include carrots, cilantro, fennel, parsnips, and Ammi. All of these plants are attractive to predatory insects such as lady beetles, Syrphid flies (hover-flies), lacewings, and tiny parasitoid wasps. West Coast Seeds encourages organic gardeners to grow dill precisely to attract these beneficial insects, for they will control pest insects like aphids, thrips, whitefly, and the caterpillar of the Small White Butterfly (cabbage moth)."

  },
  {
    "ID": "BASIL-EM",
    "BRAND": "West Coast Seeds",
    "PRODUCTNAME": "Emily Organic Basil (5g)",
    "GRAPHICNAME": "Emily_Organic.png",
    "COST": "2.10",
    "MSRP": "5.99",
    "QTYONHAND": "500",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "Emily Organic basil seeds are CERTIFIED ORGANIC! Emily is a fantastic new dwarf basil, a compact Genovese variety that works particularly well in containers. This basil was bred to have shorter stem lengths between nodes, and only reaches a maximum height of 30cm. Emily has a longer shelf life after harvest than most basil varieties, and keeps longer in refrigeration, maintaining its fresh aroma. Emily Organic is a superb choice for farms, market growers, or the home gardener. Try some of this petite but potent gourmet basil in your home patio herb garden. Pinching out the growing tips from time to time keeps this unique basil very bushy and compact."

  },
  {
    "ID": "PEPPER-PAP",
    "BRAND": "West Coast Seeds",
    "PRODUCTNAME": "Paprik Organic (2g)",
    "GRAPHICNAME": "Paprik_Organic.png",
    "COST": "4.60",
    "MSRP": "9.99",
    "QTYONHAND": "50",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "Paprik Organic pepper seeds produce hardy, vigorous plants that are very productive, even in an open field setting. Fruits have small seed cavities, so they dry easily, turning from scarlet to dark brown as they do. Fruits average 12cm long with a narrow conical shape. The plants are compact, also suitable for machine harvesting. The pods are mostly straight with a very small seed cavity that makes it easier to dry and less damage from rain drops on the fruits. Grow your own paprika – just dry the pods in decorative ristras at the end of summer. When the pods are completely dry, grind them in a clean spice mill to a very fine consistency. The fresh peppers can also be smoked prior to drying for smoked paprika: remove the stems, pith, and seeds from the fruits and cut them into 1/4 inch wide strips. Use some wood chips covered in pierced aluminum foil in an outdoor grill to produce the smoke that will flavour your peppers. Then use a dehydrator or simply allow the strips to dry naturally before grinding into powder. Matures in 90 days. (Open-pollinated seeds)"

  },
  {
    "ID": "LAV-BSP",
    "BRAND": "West Coast Seeds",
    "PRODUCTNAME": "Blue Spear Lavender (Approx. 10 seeds)",
    "GRAPHICNAME": "Blue_Spear.png",
    "COST": "2.40",
    "MSRP": "4.29",
    "QTYONHAND": "0",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "Lavandula angustifolia. This brand new cultivar of English lavender is hardy to Zone 6, but blooms in the first year, so can be grown as an annual in cooler climes. It is the tallest and showiest of the first-year-blooming types, with decidedly blue tinted flower spikes over subdued grey-green foliage. With a height of 28-33cm, Blue Spear lavender works well in containers, and potted seedlings have definite potential on the market table. From late spring to the end of summer, its spires of fragrant flowers attract all manner of pollinators. The plants have a mounded form, but are very upright, so they can be planted closer together in the row. Each plant has a width of about 28cm. Perennial."

  },
  {
    "ID": "SUNFL-SLI",
    "BRAND": "West Coast Seeds",
    "PRODUCTNAME": "Sunrich Lime Sunflower (Approx. 20 seeds)",
    "GRAPHICNAME": "Sunrich_Lime.png",
    "COST": "3.00",
    "MSRP": "5.29",
    "QTYONHAND": "600",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "The Sunrich series of hybrid sunflowers was bred with the florist trade in mind. These are highly uniform annuals that mature in 60 to 70 days from direct sowing, producing a single, upright stem, about 1.2-1.5m tall. The flowers are very round with dense numbers of petals, but the flowers produce no pollen, so they won't make a mess when they're cut and brought indoors. They make really excellent, long-lasting cut flowers, with blooms 10-15cm across. Sunrich Lime sunflower seeds are a good choice for florists and wedding planners. Their striking flowers have tightly packed lemon yellow petals around a lime green centre. The combination of colours is sensational."

  },
  {
    "ID": "MILKW-SW",
    "BRAND": "West Coast Seeds",
    "PRODUCTNAME": "Swamp Milkweed (5g)",
    "GRAPHICNAME": "Swamp_Milkweed.png",
    "COST": "5.28",
    "MSRP": "12.99",
    "QTYONHAND": "400",
    "QTYONBACKORDER": "0",
    "DESCRIPTION": "Asclepias incarnata. Swamp Milkweed begins to grow from a thick, fleshy root later in spring than many other plants. Narrow, strap-like leaves emerge, forming a clump of foliage. Then, from mid-spring to late summer, umbels of fragrant, pink to mauve flowers appear that are so generous with nectar that they attract pollinators of all kinds. This plant is particularly attractive to butterflies, including the endangered Monarch, which prefers this species on which to lay her eggs. Monarch caterpillars feed on the leaves of this milkweed despite the milky latex they contain, which is mildly toxic to most other animals. The roots of this plant have evolved to thrive in low oxygen environments, including the wet soil found around lakes and streams. The plants can reach 2m in height, and will grow in full sun to partial shade. It is hardy to Zone 3. Perennial."

  }
]
